"""
昨日回顾
"""
"""
变量：临时存储数据用于后期使用
    命名规则
        1.字母，数字，下划线组成
        2.禁止使用python关键字
        3.不能以数字开头
        4.可读性
        5.大小写敏感
        6.不能用中文和拼音
        7.驼峰体，下划线命名方式

常量：用于配置文件，全大写的英文字母命名

注释 #单行注释
    '''多行注释''' 及三双引号

数据基础类型
    int 整型 + - * /算术运算及比较
        /返回的是浮点型（python2返回整型）
    str 字符串 用引号引起来的内容
        可拼接（+）与字符串类型
        可乘（*）与整数相乘进行复制
    bool型 True False
    int()转换字符串为整型，字符串需要全为数字
    str()转换数字为字符串
    type()获取变量类型

输入
    input('提示语')
    input获取的内容都是字符串

流程控制语句
    if
    if elif 
    if elif else
"""
